Repository: Patricia370/Health-Bits-Project-1
Catalog: Health Bits Project-level1.tmx
Source language: en_us
Languages: es

source: (Continued from first page)
es: (Continuación de la primera página)

source: (Continued on next page)
es: (Continúa en la siguiente página)

source: 4 • Issue 9
es: 4 • Número 9

source: A deli luncheon will be served.
es: Habrá comida para los invitados.

source: A repetitive strain injury (RSI) is an injury or disorder of the joints, nerves, muscles, ligaments or tendons.
es: Una lesión por trabajo repetitivo (LTR) es una lesión o trastorno de los tendones, nervios, ligamentos o músculos..

source: Another type of health-related condition due to computer use is computer vision syndrome (CVS).
es: Otro tipo de lesión relacionada con el uso de ordenadores es el síndrome de visión de ordenador (SVO)

source: Beginning May 1, Health Bits Group members are entitled to a 10 percent discount on regular price products at these stores: Office Warehouse, Simply Nutrition, and The Sports Center.
es: A partir del 1 de mayo, los miembros de Health Bits tendrán derecho a un 10% de descuento sobre los precios regulares de los productor de Office Warehouse, Cimply Nutrition, y The Sports Center.

source: CVS is not believed to have serious or long-term consequences.
es: No se conoce que este síndrome pueda tener consecuencias a largo plazo

source: Carpal tunnel syndrome (CTS) is inflammation of the nerve that connects the forearm to the palm of the hand.
es: El síndrome del túnel carpiano es una inflamación del nervio que conecta el brazo con la palma de la mano

source: Common symptoms linked to tendonitis of the wrist include extreme pain that extends from the forearm to the hand, along with a tingling feeling in the fingers.
es: Los síntomas comunes ligados a la tendonitis en la muñeca incluyen dolor agudo que se extiende por el brazo, así como adormecimiento en los dedos.

source: Computer users should be proactive and minimize their chance of health complications.
es: Los usuarios de ordenador puede prevenir y reducir las posibilidades de sufrir complicaciones

source: Computer-related RSIs include tendonitis and carpal tunnel syndrome.
es: Las LTR causadas por el ordenador incluyen tendonitis y síndrome del túner carpiano.

source: Ergonomics is an applied science devoted to including comfort, efficiency, and safety in the design of the workplace.
es: La ergonomía es una ciencia aplicada dedicada a asegurar la comodidad, eficiencia y seguridad en el diseño del lugar de trabajo.

source: Finally, minimize the number of times you switch between the mouse and the keyboard, and avoid using the heel of your hand as a pivot point while typing or using the mouse.
es: Finalmente, reduce el número de veces que cambias entre ratón y teclado , y evita emplear la mano como punto de apoyo mientras realizas alguna tarea.

source: For the computer area, experts recommend a workspace of at least two feet by four feet.
es: En cuanto al área de trabajo, se recomienda que tenga entre dos y cuatro pies.

source: GROUP MEETING
es: REUNIÓN DE GRUPO

source: Health Concerns Related to Computer Use
es: Problemas de salud relacionados con el uso de ordenadores

source: If untreated, these disorders can lead to permanent damage to your body.
es: Si no se trata, estos trastornos pueden derivar en lesiones permanentes.

source: In this position, your wrist is flat on the desk.
es: De forma que la muñeca quede plana sobre el escritorio.

source: Long-term computer work can lead to tendonitis or CTS.
es: El trabajo a largo plazo con ordenadores puede derivar en tendonitis o STC.

source: MEMBER DISCOUNTS
es: DESCUENTOS PARA MIEMBROS

source: Monthly Newsletter
es: Boletín mensual

source: NEXT ISSUE
es: PRÓXIMO NÚMERO

source: Next month’s issue of Health Bits will discuss hay fever and other pollen-related allergies.
es: El número del mes que viene tratará de la fiebre del heno y de otras alergias relacionadas con el polen.

source: OSHA (Occupational Safety and Health Administration) has guidelines designed to minimize or prevent workplace injuries with respect to computer usage.
es: OSHA (Occupational Safety and Health Administration) tiene manuales diseñados con el fin de atenuar o prevenir estas lesiones.

source: One way to help prevent these injuries is to be sure the workplace is designed ergonomically.
es: Una forma de prevenir estas lesiones es asegurar que el lugar de trabajo está diseñado ergonómicamente.

source: People who spend entire days using a computer sometimes complain of lower back pain and muscle fatigue.
es: La gente que se pasa días completos utilizando el ordenador a veces padece dolor de espalda y fatiga muscular.

source: RSIs are the largest job related injury and illness problem in the U.S.
es: Las LTR son las lesiones por trabajo más extendidas en EEUU.

source: RSIs are the largest job-related injury and illness problem in the U.S.
es: Las LTR son las lesiones por trabajo más extendidas en EEUU.

source: Repeated and/or forceful bending of the wrist can cause tendonitis or CTS.
es: Los movimientos repetitivos o forzados de la muñeca pueden causar tendonitis o STC.

source: Some symptoms of CTS include numbness and tingling in the thumb and first two fingers, and a burning pain when the nerve is compressed.
es: Algunos síntomas del STC incluyen adormecimiento en los dedos, exceptuando el meñique y el anular, y dolor cuando se comprime el nervio.

source: Studies have shown that using the correct configuration and type of chair, keyboard, display device, and work surface helps users work comfortably and efficiently and helps protect their health.
es: Los estudios han demostrado que utilizar la correcta configuración y tipo de silla, teclado, pantalla y superficie de trabajo ayuda a los usuarios a trabajar de forma cómoda y eficiente.

source: T
es: E

source: Take frequent breaks to exercise your hands.
es: Haz descansos frecuentes para ejercitar las manos.

source: Tendonitis is inflammation of a tendon due to repeated motion or stress on that tendon.
es: La tendonitis es una inflamación del tendón causada por movimientos repetitivos o estrés.

source: The back pain sometimes is caused from poor posture.
es: La espalda a veces duele debido a una mala postura.

source: The guest speaker, Sean Riverton, will discuss how to keep our environment healthy.
es: El ponente invitado, Sean Riverton, hablará sobre cómo mantener nuestro medioambiente sano.

source: The next meeting of the Health Bits Group will be held on Saturday, May 17, at the Glenview Recreation Center (440 Cedar Street) from 11:30 a.m. to 3:00 p.m.
es: La siguiente reunión del grupo Health Bits tendrá lugar el sábado 17 de mayo, en el centro Glenview Recreation de 11:30 a.m. to 3:00 p.m.

source: This article discusses computer health risks and preventions.
es: Este artículo trata de los problemas de salud que causan los ordenadores y cómo prevenirlos.

source: To prevent injury due to typing, place a wrist rest between the keyboard and the edge of your desk.
es: Para prevenir lesiones causadas por escribir a ordenador, coloca la muñeca entre el teclado y el borde del escritorio.

source: To prevent injury while using a mouse, place the mouse at least six inches from
es: Para prevenir lesiones por el uso del ratón, coloca el mismo a al menos seis pulgadas de

source: To receive the discount, show your Health Bits Group membership card at the time of purchase.
es: Para recibir el descuento, muestra tu tarjeta de membresía en el momento de la compra.

source: You can take many precautions to prevent these types of injuries.
es: Puedes tomar muchas precaciones para prevenir estas lesiones.

source: You may have CVS if you have sore, tired, burning, itching, or dry eyes; headache or sore neck; blurred or double vision; increased sensitivity to light; and difficulty focusing.
es: Puedes padecerlo si tienes dolor, cansancio, escozor, picor, ojos secos; dolor de cabella o cuello; visión nublada o doble; hipersensibilidad a la luz y dificultad para enfocar

source: he widespread use of computers has been causing health concerns.
es: l uso prolongado de ordenadores ha causado problemas de salud.

source: the edge of the desk.
es: el borde de la mesa.

source: today.
es: hoy en día.
